// 循环语句
//int i,j,res;
// for (初始化语句; 判断条件; 更新语句) 这三个可以任意空缺
//for (i = 0,j = 0; i < 3; i++,j--)
//{ //循环体
    /* 语句 */
//    res+= i*j;
//}

// break; 跳出循环，退出循环
// continue; 跳过这次循环，执行下一次循环

// while循环
// 每次循环前判断条件是否成立，否则退出循环
// while (条件语句)
// {
//     /* 语句 */
// }

//do-while循环
// do
// {
//     /* code */
// } while (condition);
//与while的差别只是这个会先执行一遍再判断条件

// C++11 基于范围的for循环
// for (元素 ： 范围表达式)
// {
//     /* code */
// }
// 元素是每次循环按照顺序获得的范围中的一个元素，可以是数组 或是其它遍历的对象
// int numbers[]{1,2,3,4,5,6};
// for (auto number : numbers)
// {
//     cout << number << endl;
// }

